emacs tutorial/orgtut.tex
% Created 2020-02-05 Wed 02:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\#-\textbf{- mode: org -}-

\section{Welcome to Org mode}
\label{sec:orga5e3e6c}

Welcome, and thanks for trying out Org mode. Making outlines in
Org is very simple. It is just text! Just start typing.
\section{This is a headline, it starts with one or more stars}
\label{sec:org2790b52}
A heading has one star, a sub-heading two, etc.
\section{Working with lists}
\label{sec:org8e55439}
\subsection{Moving around in our outline}
\label{sec:orga3488a8}
\subsection{Moving around headlines}
\label{sec:orgf63be36}


\subsection{Lord of the Rings}
\label{sec:orgc463dd1}
My favorite scenes are (in this order)
\begin{enumerate}
\item The attack of the Rohirrim
\item Eowyn's fight with the witch king
\begin{itemize}
\item this was already my favorite scene in the book
\item I really like Miranda Otto.
\end{itemize}
\item Peter Jackson being shot by Legolas
\begin{itemize}
\item on DVD only
\end{itemize}
He makes a really funny face when it happens.
\end{enumerate}
But in the end, no individual scenes matter but the film as a whole.
Important actors in this film are:
\begin{description}
\item[{Elijah Wood}] He plays Frodo
\item[{Sean Austi}] He plays Sam, Frodo's friend.  I still remember
him very well from his role as Mikey Walsh in The Goonies.
\end{description}



\section{Tables}
\label{sec:org30bf66f}

\section{Export to other formats}
\label{sec:orgc886f79}

\section{Source Code}
\label{sec:orgb971282}
We can also run the source code blocks inside emacs
\begin{verbatim}
def fact(n)
  if n == 0
    1
  else
    n * fact(n-1)
  end
end
\end{verbatim}

\section{Latex integration}
\label{sec:orgd5b633d}
\begin{itemize}
\item characters: \aplha \(\rightarrow\) \(\beta\)
\item \(O(n \log n)\)
\end{itemize}

\begin{align*}
 3 * 2 + &= 6 + 1 \\
   &= 7
\end{align*}
\end{document}
